In [2]:
import pandas as pd
import numpy as np

In [46]:
df = pd.DataFrame({'A' : np.random.randint(0, 4, 8),
                   'B' : np.random.randint(0, 4, 8),
                   'C' : np.abs(np.random.randn(8))})

In [47]:
df

   A  B         C
0  1  2  0.504518
1  2  2  0.331379
2  2  3  0.524956
3  3  3  1.099676
4  1  3  0.357635
5  0  1  0.745891
6  1  1  1.735477
7  0  1  1.533499

In [48]:
grouped = df.groupby(['A','B'])

In [49]:
summed = grouped.sum()

In [50]:
summed

            C
A B
0 1  2.279390
1 1  1.735477
  2  0.504518
  3  0.357635
2 2  0.331379
  3  0.524956
3 3  1.099676

In [51]:
summed['log10(C)'] = np.log10(summed['C'])

In [53]:
summed

            C  log10(C)
A B
0 1  2.279390  0.357819
1 1  1.735477  0.239419
  2  0.504518 -0.297123
  3  0.357635 -0.446560
2 2  0.331379 -0.479674
  3  0.524956 -0.279877
3 3  1.099676  0.041265

In [55]:
for i in summed.index:
    (a, b), v = i, summed.loc[i, 'log10(C)']
    print(a,b,v)

0 1 0.357818619612
1 1 0.239418820637
1 2 -0.29712299087
1 3 -0.446560101876
2 2 -0.479674435235
2 3 -0.279876971586
3 3 0.041264677007

In [62]:
summed[summed['log10(C)'] > 0]

            C  log10(C)
A B
0 1  2.279390  0.357819
1 1  1.735477  0.239419
3 3  1.099676  0.041265

In [72]:
summed

            C  log10(C)
A B
0 1  2.279390  0.357819
1 1  1.735477  0.239419
  2  0.504518 -0.297123
  3  0.357635 -0.446560
2 2  0.331379 -0.479674
  3  0.524956 -0.279877
3 3  1.099676  0.041265

In [75]:
for (A, B), v in summed.iterrows():
    print(A, B, v)

0 1 C           2.279390
log10(C)    0.357819
Name: (0, 1), dtype: float64
1 1 C           1.735477
log10(C)    0.239419
Name: (1, 1), dtype: float64
1 2 C           0.504518
log10(C)   -0.297123
Name: (1, 2), dtype: float64
1 3 C           0.357635
log10(C)   -0.446560
Name: (1, 3), dtype: float64
2 2 C           0.331379
log10(C)   -0.479674
Name: (2, 2), dtype: float64
2 3 C           0.524956
log10(C)   -0.279877
Name: (2, 3), dtype: float64
3 3 C           1.099676
log10(C)    0.041265
Name: (3, 3), dtype: float64

In [59]:
v

C           1.099676
log10(C)    0.041265
Name: (3, 3), dtype: float64

In [64]:
summed.columns

Index(['C', 'log10(C)'], dtype='object')

In [65]:
summed

            C  log10(C)
A B
0 1  2.279390  0.357819
1 1  1.735477  0.239419
  2  0.504518 -0.297123
  3  0.357635 -0.446560
2 2  0.331379 -0.479674
  3  0.524956 -0.279877
3 3  1.099676  0.041265

In [63]:
import matplotlib.pyplot as plt

ModuleNotFoundError: No module named 'matplotlib'